stm32-rs/stm32g0xx-hal/src/serial/usart.rs
use crate::dma;
use crate::dmamux::DmaMuxIndex;
use crate::gpio::{AltFunction, *};
use crate::rcc::*;
use crate::serial::config::*;
use crate::stm32::*;
use core::fmt;
use core::marker::PhantomData;
use cortex_m::interrupt;
use nb::block;

/// Serial error
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Copy, Clone, Debug, PartialEq, Eq)]
pub enum Error {
    /// Framing error
    Framing,
    /// Noise error
    Noise,
    /// RX buffer overrun
    Overrun,
    /// Parity check error
    Parity,
}

/// Interrupt event
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Copy, Clone, Debug, PartialEq, Eq)]
pub enum Event {
    /// TXFIFO reaches the threshold
    TXFT = 1 << 27,
    /// This bit is set by hardware when the threshold programmed in RXFTCFG in USART_CR3 register is reached.
    RXFT = 1 << 26,

    /// RXFIFO full
    RXFF = 1 << 24,
    /// TXFIFO empty
    TXFE = 1 << 23,

    /// Active when a communication is ongoing on the RX line
    BUSY = 1 << 16,

    /// Receiver timeout.This bit is set by hardware when the timeout value,
    /// programmed in the RTOR register has lapsed, without any communication.
    RTOF = 1 << 11,
    /// Transmit data register empty. New data can be sent
    Txe = 1 << 7,

    /// Transmission Complete. The last data written in the USART_TDR has been transmitted out of the shift register.
    TC = 1 << 6,
    /// New data has been received
    Rxne = 1 << 5,
    /// Idle line state detected
    Idle = 1 << 4,

    /// Overrun error
    ORE = 1 << 3,

    /// Noise detection flag
    NE = 1 << 2,

    /// Framing error
    FE = 1 << 1,

    /// Parity error
    PE = 1 << 0,
}

impl Event {
    fn val(self) -> u32 {
        self as u32
    }
}

/// Serial receiver
pub struct Rx<USART, Config> {
    _usart: PhantomData<USART>,
    _config: PhantomData<Config>,
}

/// Serial transmitter
pub struct Tx<USART, Config> {
    _usart: PhantomData<USART>,
    _config: PhantomData<Config>,
}

/// Serial abstraction
pub struct Serial<USART, Config> {
    tx: Tx<USART, Config>,
    rx: Rx<USART, Config>,
    usart: USART,
    _config: PhantomData<Config>,
}

// Serial TX pin
pub trait TxPin<USART> {
    fn setup(&self);
    fn release(self) -> Self;
}

// Serial RX pin
pub trait RxPin<USART> {
    fn setup(&self);
    fn release(self) -> Self;
}

pub struct NoTx;

impl<USART> TxPin<USART> for NoTx {
    fn setup(&self) {}

    fn release(self) -> Self {
        self
    }
}
pub struct NoRx;

impl<USART> RxPin<USART> for NoRx {
    fn setup(&self) {}

    fn release(self) -> Self {
        self
    }
}

// Driver enable pin
pub trait DriverEnablePin<USART> {
    fn setup(&self);
    fn release(self) -> Self;
}

// Serial pins
pub trait Pins<USART> {
    const DRIVER_ENABLE: bool;

    fn setup(&self);
    fn release(self) -> Self;
}

// Duplex mode
impl<USART, TX, RX> Pins<USART> for (TX, RX)
where
    TX: TxPin<USART>,
    RX: RxPin<USART>,
{
    const DRIVER_ENABLE: bool = false;

    fn setup(&self) {
        self.0.setup();
        self.1.setup();
    }

    fn release(self) -> Self {
        (self.0.release(), self.1.release())
    }
}

// Duplex mode with driver enabled
impl<USART, TX, RX, DE> Pins<USART> for (TX, RX, DE)
where
    TX: TxPin<USART>,
    RX: RxPin<USART>,
    DE: DriverEnablePin<USART>,
{
    const DRIVER_ENABLE: bool = true;

    fn setup(&self) {
        self.0.setup();
        self.1.setup();
        self.2.setup();
    }

    fn release(self) -> Self {
        (self.0.release(), self.1.release(), self.2.release())
    }
}

pub trait SerialExt<CONFIG>: Sized {
    fn usart(
        self,
        pins: impl Pins<Self>,
        config: CONFIG,
        rcc: &mut Rcc,
    ) -> Result<Serial<Self, CONFIG>, InvalidConfig>;
}

macro_rules! uart_shared {
    ($USARTX:ident, $dmamux_rx:ident, $dmamux_tx:ident,
        tx: [ $(($PTX:ident, $TAF:expr),)+ ],
        rx: [ $(($PRX:ident, $RAF:expr),)+ ],
        de: [ $(($PDE:ident, $DAF:expr),)+ ]) => {

        $(
            impl<MODE> TxPin<$USARTX> for $PTX<MODE> {
                fn setup(&self) {
                    self.set_alt_mode($TAF)
                }

                fn release(self) -> Self {
                    self
                }
            }
        )+

        $(
            impl<MODE> RxPin<$USARTX> for $PRX<MODE> {
                fn setup(&self) {
                    self.set_alt_mode($RAF)
                }

                fn release(self) -> Self {
                    self
                }
            }
        )+

        $(
            impl<MODE> DriverEnablePin<$USARTX> for $PDE<MODE> {
                fn setup(&self) {
                    self.set_alt_mode($DAF)
                }

                fn release(self) -> Self {
                    self
                }
            }
        )+

        impl<Config> Rx<$USARTX, Config> {
            /// Listen for a data interrupt event
            pub fn listen(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.rxneie().set_bit());
            }

            /// Stop listening for a data interrupt event
            pub fn unlisten(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.rxneie().clear_bit());
            }

            /// Return true if the rx register is not empty (and can be read)
            pub fn is_rxne(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                #[cfg(not(any(feature = "stm32g0b1", feature = "stm32g0c1")))]
                let f = usart.isr().read().rxne().bit_is_set();
                #[cfg(any(feature = "stm32g0b1", feature = "stm32g0c1"))]
                let f = usart.isr().read().rxfne().bit_is_set();
                f
            }

            /// Listen for an idle interrupt event
            pub fn listen_idle(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.idleie().set_bit());
            }

