stm32-rs/stm32g0xx-hal/src/serial/usart.rs
            /// Stop listening for an idle interrupt event
            pub fn unlisten_idle(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.idleie().clear_bit());
            }

            /// Return true if the idle event occured
            pub fn is_idle(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().idle().bit_is_set()
            }

            /// Clear the idle event flag
            pub fn clear_idle(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.icr().write(|w| w.idlecf().set_bit());
            }
        }

        impl<Config> Rx<$USARTX, Config> {
            pub fn read(&mut self) -> nb::Result<u8, Error> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                let isr = usart.isr().read();
                Err(
                    if isr.pe().bit_is_set() {
                        usart.icr().write(|w| w.pecf().set_bit());
                        nb::Error::Other(Error::Parity)
                    } else if isr.fe().bit_is_set() {
                        usart.icr().write(|w| w.fecf().set_bit());
                        nb::Error::Other(Error::Framing)
                    } else if {
                        #[cfg(not(any(feature = "stm32g0b1", feature = "stm32g0c1")))]
                        let f = isr.nf().bit_is_set();
                        #[cfg(any(feature = "stm32g0b1", feature = "stm32g0c1"))]
                        let f = isr.ne().bit_is_set();
                        f
                    }
                    {
                        #[cfg(not(any(feature = "stm32g0b1", feature = "stm32g0c1")))]
                        usart.icr().write(|w| w.ncf().set_bit());
                        #[cfg(any(feature = "stm32g0b1", feature = "stm32g0c1"))]
                        usart.icr().write(|w| w.necf().set_bit());
                        nb::Error::Other(Error::Noise)
                    } else if isr.ore().bit_is_set() {
                        usart.icr().write(|w| w.orecf().set_bit());
                        nb::Error::Other(Error::Overrun)
                    } else if {
                        #[cfg(not(any(feature = "stm32g0b1", feature = "stm32g0c1")))]
                        let f = isr.rxne().bit_is_set();
                        #[cfg(any(feature = "stm32g0b1", feature = "stm32g0c1"))]
                        let f = isr.rxfne().bit_is_set();
                        f
                    } {
                        return Ok(usart.rdr().read().bits() as u8)
                    } else {
                        nb::Error::WouldBlock
                    }
                )
            }
        }

        impl<Config> Serial<$USARTX, Config> {
            pub fn read(&mut self) -> nb::Result<u8, Error> {
                self.rx.read()
            }
        }

        impl<Config> Tx<$USARTX, Config> {
            /// Starts listening for an interrupt event
            pub fn listen(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.txeie().set_bit());
            }

            /// Stop listening for an interrupt event
            pub fn unlisten(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.cr1().modify(|_, w| w.txeie().clear_bit());
            }

            /// Return true if the tx register is empty (and can accept data)
            pub fn is_txe(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                #[cfg(not(any(feature = "stm32g0b1", feature = "stm32g0c1")))]
                let f = usart.isr().read().txe().bit_is_set();
                #[cfg(any(feature = "stm32g0b1", feature = "stm32g0c1"))]
                let f = usart.isr().read().txfnf().bit_is_set();
                f
            }

        }

        impl<Config> Tx<$USARTX, Config> {
            pub fn flush(&mut self) -> nb::Result<(), nb::Error<Error>> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                if usart.isr().read().tc().bit_is_set() {
                    Ok(())
                } else {
                    Err(nb::Error::WouldBlock)
                }
            }

            pub fn write(&mut self, byte: u8) -> nb::Result<(), nb::Error<Error>> {
                let usart = unsafe { &(*$USARTX::ptr()) };
                if {
                    #[cfg(not(any(feature = "stm32g0b1", feature = "stm32g0c1")))]
                    let f = usart.isr().read().txe().bit_is_set();
                    #[cfg(any(feature = "stm32g0b1", feature = "stm32g0c1"))]
                    let f = usart.isr().read().txfnf().bit_is_set();
                    f
                } {
                    usart.tdr().write(|w| unsafe { w.bits(byte as u32) });
                    Ok(())
                } else {
                    Err(nb::Error::WouldBlock)
                }
            }
        }

        impl<Config> Serial<$USARTX, Config> {
            pub fn flush(&mut self) -> nb::Result<(), nb::Error<Error>> {
                self.tx.flush()
            }

            pub fn write(&mut self, byte: u8) -> nb::Result<(), nb::Error<Error>> {
                self.tx.write(byte)
            }
        }

        impl<Config> Serial<$USARTX, Config> {
            /// Separates the serial struct into separate channel objects for sending (Tx) and
            /// receiving (Rx)
            pub fn split(self) -> (Tx<$USARTX, Config>, Rx<$USARTX, Config>) {
                (self.tx, self.rx)
            }

        }

        impl<Config> dma::Target for Rx<$USARTX, Config> {
            fn dmamux(&self) -> DmaMuxIndex {
                DmaMuxIndex::$dmamux_rx
            }

            fn enable_dma(&mut self) {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmar().set_bit());
                });
            }

