stm32-rs/stm32g0xx-hal/src/serial/usart.rs
            fn disable_dma(&mut self) {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmar().clear_bit());
                });
            }
        }

        impl<Config> dma::Target for Tx<$USARTX, Config> {
            fn dmamux(&self) -> DmaMuxIndex {
                DmaMuxIndex::$dmamux_tx
            }

            fn enable_dma(&mut self) {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmat().set_bit());
                });
            }

            fn disable_dma(&mut self) {
                // NOTE(unsafe) critical section prevents races
                interrupt::free(|_| unsafe {
                    let cr3 = &(*$USARTX::ptr()).cr3();
                    cr3.modify(|_, w| w.dmat().clear_bit());
                });
            }
        }
    }
}

macro_rules! uart_basic {
    ($USARTX:ident,
        $usartX:ident, $clk_mul:expr
    ) => {
        impl SerialExt<BasicConfig> for $USARTX {
            fn usart(
                self,
                pins: impl Pins<Self>,
                config: BasicConfig,
                rcc: &mut Rcc,
            ) -> Result<Serial<$USARTX, BasicConfig>, InvalidConfig> {
                Serial::$usartX(self, pins, config, rcc)
            }
        }

        impl Serial<$USARTX, BasicConfig> {
            pub fn $usartX<PINS: Pins<$USARTX>>(
                usart: $USARTX,
                pins: PINS,
                config: BasicConfig,
                rcc: &mut Rcc,
            ) -> Result<Self, InvalidConfig> {
                // Enable clock for USART
                $USARTX::enable(rcc);

                let clk = rcc.clocks.apb_clk.raw() as u64;
                let bdr = config.baudrate.0 as u64;
                let div = ($clk_mul * clk) / bdr;
                usart.brr().write(|w| unsafe { w.bits(div as u32) });
                // Reset other registers to disable advanced USART features
                usart.cr2().reset();
                usart.cr3().reset();

                // Disable USART, there are many bits where UE=0 is required
                usart.cr1().modify(|_, w| w.ue().clear_bit());

                // Enable transmission and receiving
                usart.cr1().write(|w| {
                    w.te()
                        .set_bit()
                        .re()
                        .set_bit()
                        .m0()
                        .bit(config.wordlength == WordLength::DataBits9)
                        .m1()
                        .bit(config.wordlength == WordLength::DataBits7)
                        .pce()
                        .bit(config.parity != Parity::ParityNone)
                        .ps()
                        .bit(config.parity == Parity::ParityOdd)
                });

                usart.cr2().write(|w| unsafe {
                    w.stop()
                        .bits(match config.stopbits {
                            StopBits::STOP1 => 0b00,
                            StopBits::STOP0P5 => 0b01,
                            StopBits::STOP2 => 0b10,
                            StopBits::STOP1P5 => 0b11,
                        })
                        .txinv()
                        .bit(config.inverted_tx)
                        .rxinv()
                        .bit(config.inverted_rx)
                        .swap()
                        .bit(config.swap)
                });

                usart.cr3().write(|w| w.dem().bit(PINS::DRIVER_ENABLE));

                // Enable pins
                pins.setup();

                // Enable USART
                usart.cr1().modify(|_, w| w.ue().set_bit());

                Ok(Serial {
                    tx: Tx {
                        _usart: PhantomData,
                        _config: PhantomData,
                    },
                    rx: Rx {
                        _usart: PhantomData,
                        _config: PhantomData,
                    },
                    usart,
                    _config: PhantomData,
                })
            }

            /// Starts listening for an interrupt event
            pub fn listen(&mut self, event: Event) {
                match event {
                    Event::Rxne => {
                        self.usart.cr1().modify(|_, w| w.rxneie().set_bit());
                    }
                    Event::Txe => {
                        self.usart.cr1().modify(|_, w| w.txeie().set_bit());
                    }
                    Event::Idle => {
                        self.usart.cr1().modify(|_, w| w.idleie().set_bit());
                    }
                    _ => {}
                }
            }

            /// Stop listening for an interrupt event
            pub fn unlisten(&mut self, event: Event) {
                match event {
                    Event::Rxne => {
                        self.usart.cr1().modify(|_, w| w.rxneie().clear_bit());
                    }
                    Event::Txe => {
                        self.usart.cr1().modify(|_, w| w.txeie().clear_bit());
                    }
                    Event::Idle => {
                        self.usart.cr1().modify(|_, w| w.idleie().clear_bit());
                    }
                    _ => {}
                }
            }

            /// Check if interrupt event is pending
            pub fn is_pending(&mut self, event: Event) -> bool {
                (self.usart.isr().read().bits() & event.val()) != 0
            }

            /// Clear pending interrupt
            pub fn unpend(&mut self, event: Event) {
                // mask the allowed bits
                let mask: u32 = 0x123BFF;
                self.usart
                    .icr()
                    .write(|w| unsafe { w.bits(event.val() & mask) });
            }
        }

        impl fmt::Write for Tx<$USARTX, BasicConfig> {
            fn write_str(&mut self, s: &str) -> fmt::Result {
                let _ = s.as_bytes().iter().map(|c| block!(self.write(*c))).last();
                Ok(())
            }
        }

        impl fmt::Write for Serial<$USARTX, BasicConfig> {
            fn write_str(&mut self, s: &str) -> fmt::Result {
                let _ = s.as_bytes().iter().map(|c| block!(self.write(*c))).last();
                Ok(())
            }
        }
    };
}

macro_rules! uart_full {
    ($USARTX:ident,
        $usartX:ident, $clk_mul:expr
    ) => {
        impl SerialExt<FullConfig> for $USARTX {
            fn usart(
                self,
                pins: impl Pins<Self>,
                config: FullConfig,
                rcc: &mut Rcc,
            ) -> Result<Serial<Self, FullConfig>, InvalidConfig> {
                Serial::$usartX(self, pins, config, rcc)
            }
        }

        impl Serial<$USARTX, FullConfig> {
            pub fn $usartX<PINS: Pins<$USARTX>>(
                usart: $USARTX,
                pins: PINS,
                config: FullConfig,
                rcc: &mut Rcc,
            ) -> Result<Self, InvalidConfig> {
                // Enable clock for USART
                $USARTX::enable(rcc);

