stm32-rs/stm32g0xx-hal/src/serial/usart.rs
                let clk = rcc.clocks.apb_clk.raw() as u64;
                let bdr = config.baudrate.0 as u64;
                let clk_mul = 1;
                let div = (clk_mul * clk) / bdr;
                usart.brr().write(|w| unsafe { w.bits(div as u32) });

                usart.cr1().reset();
                usart.cr2().reset();
                usart.cr3().reset();

                usart.cr2().write(|w| unsafe {
                    w.stop().bits(config.stopbits.bits());
                    w.txinv().bit(config.inverted_tx);
                    w.rxinv().bit(config.inverted_rx);
                    w.swap().bit(config.swap)
                });

                if let Some(timeout) = config.receiver_timeout {
                    usart.cr1().write(|w| w.rtoie().set_bit());
                    usart.cr2().modify(|_, w| w.rtoen().set_bit());
                    usart.rtor().write(|w| unsafe { w.rto().bits(timeout) });
                }

                usart.cr3().write(|w| unsafe {
                    w.txftcfg()
                        .bits(config.tx_fifo_threshold.bits())
                        .rxftcfg()
                        .bits(config.rx_fifo_threshold.bits())
                        .txftie()
                        .bit(config.tx_fifo_interrupt)
                        .rxftie()
                        .bit(config.rx_fifo_interrupt)
                        .dem()
                        .bit(PINS::DRIVER_ENABLE)
                });

                usart.cr1().modify(|_, w| {
                    w.ue()
                        .set_bit()
                        .te()
                        .set_bit()
                        .re()
                        .set_bit()
                        .m0()
                        .bit(config.wordlength == WordLength::DataBits9)
                        .m1()
                        .bit(config.wordlength == WordLength::DataBits7)
                        .pce()
                        .bit(config.parity != Parity::ParityNone)
                        .ps()
                        .bit(config.parity == Parity::ParityOdd)
                        .fifoen()
                        .bit(config.fifo_enable)
                });

                // Enable pins
                pins.setup();

                Ok(Serial {
                    tx: Tx {
                        _usart: PhantomData,
                        _config: PhantomData,
                    },
                    rx: Rx {
                        _usart: PhantomData,
                        _config: PhantomData,
                    },
                    usart,
                    _config: PhantomData,
                })
            }

            /// Starts listening for an interrupt event
            pub fn listen(&mut self, event: Event) {
                match event {
                    Event::Rxne => {
                        self.usart.cr1().modify(|_, w| w.rxneie().set_bit());
                    }
                    Event::Txe => {
                        self.usart.cr1().modify(|_, w| w.txeie().set_bit());
                    }
                    Event::Idle => {
                        self.usart.cr1().modify(|_, w| w.idleie().set_bit());
                    }
                    _ => {}
                }
            }

            /// Stop listening for an interrupt event
            pub fn unlisten(&mut self, event: Event) {
                match event {
                    Event::Rxne => {
                        self.usart.cr1().modify(|_, w| w.rxneie().clear_bit());
                    }
                    Event::Txe => {
                        self.usart.cr1().modify(|_, w| w.txeie().clear_bit());
                    }
                    Event::Idle => {
                        self.usart.cr1().modify(|_, w| w.idleie().clear_bit());
                    }
                    _ => {}
                }
            }

            /// Check if interrupt event is pending
            pub fn is_pending(&mut self, event: Event) -> bool {
                (self.usart.isr().read().bits() & event.val()) != 0
            }

            /// Clear pending interrupt
            pub fn unpend(&mut self, event: Event) {
                // mask the allowed bits
                let mask: u32 = 0x123BFF;
                self.usart
                    .icr()
                    .write(|w| unsafe { w.bits(event.val() & mask) });
            }
        }

        impl Tx<$USARTX, FullConfig> {
            /// Returns true if the tx fifo threshold has been reached.
            pub fn fifo_threshold_reached(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().txft().bit_is_set()
            }
        }

        impl Rx<$USARTX, FullConfig> {
            /// Check if receiver timeout has lapsed
            /// Returns the current state of the ISR RTOF bit
            pub fn timeout_lapsed(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().rtof().bit_is_set()
            }

            /// Clear pending receiver timeout interrupt
            pub fn clear_timeout(&mut self) {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.icr().write(|w| w.rtocf().set_bit());
            }

            /// Returns true if the rx fifo threshold has been reached.
            pub fn fifo_threshold_reached(&self) -> bool {
                let usart = unsafe { &(*$USARTX::ptr()) };
                usart.isr().read().rxft().bit_is_set()
            }
        }

        impl fmt::Write for Tx<$USARTX, FullConfig> {
            fn write_str(&mut self, s: &str) -> fmt::Result {
                let _ = s.as_bytes().iter().map(|c| block!(self.write(*c))).last();
                Ok(())
            }
        }

        impl fmt::Write for Serial<$USARTX, FullConfig> {
            fn write_str(&mut self, s: &str) -> fmt::Result {
                let _ = s.as_bytes().iter().map(|c| block!(self.write(*c))).last();
                Ok(())
            }
        }
    };
}

uart_shared!(USART1, USART1_RX, USART1_TX,
    tx: [
        (PA9, AltFunction::AF1),
        (PB6, AltFunction::AF0),
        (PC4, AltFunction::AF1),
    ],
    rx: [
        (PA10, AltFunction::AF1),
        (PB7, AltFunction::AF0),
        (PC5, AltFunction::AF1),
    ],
    de: [
        (PA12, AltFunction::AF1),
        (PB3, AltFunction::AF4),
    ]
);

