stm32-rs/stm32g0xx-hal/src/serial/usart.rs
uart_shared!(USART2, USART2_RX, USART2_TX,
    tx: [
        (PA2, AltFunction::AF1),
        (PA14, AltFunction::AF1),
        (PD5, AltFunction::AF0),
    ],
    rx: [
        (PA3, AltFunction::AF1),
        (PA15, AltFunction::AF1),
        (PD6, AltFunction::AF0),
    ],
    de: [
        (PA1, AltFunction::AF1),
        (PD4, AltFunction::AF0),
    ]
);

#[cfg(any(feature = "stm32g070", feature = "stm32g071", feature = "stm32g081"))]
uart_shared!(USART3, USART3_RX, USART3_TX,
    tx: [
        (PA5, AltFunction::AF4),
        (PB2, AltFunction::AF4),
        (PB8, AltFunction::AF4),
        (PB10, AltFunction::AF4),
        (PC4, AltFunction::AF0),
        (PC10, AltFunction::AF0),
        (PD8, AltFunction::AF0),
    ],
    rx: [
        (PB0, AltFunction::AF4),
        (PB9, AltFunction::AF4),
        (PB11, AltFunction::AF4),
        (PC5, AltFunction::AF0),
        (PC11, AltFunction::AF0),
        (PD9, AltFunction::AF0),
    ],
    de: [
        (PA15, AltFunction::AF5),
        (PB1, AltFunction::AF4),
        (PB14, AltFunction::AF4),
        (PD2, AltFunction::AF0),
        (PD12, AltFunction::AF0),
    ]
);

#[cfg(any(feature = "stm32g070", feature = "stm32g071", feature = "stm32g081"))]
uart_shared!(USART4, USART4_RX, USART4_TX,
    tx: [
        (PA0, AltFunction::AF4),
        (PC10, AltFunction::AF1),
    ],
    rx: [
        (PC11, AltFunction::AF1),
        (PA1, AltFunction::AF4),
    ],
    de: [
        (PA15, AltFunction::AF4),
    ]
);

#[cfg(feature = "stm32g0x1")]
#[cfg(not(any(feature = "stm32g0b1", feature = "stm32g0c1")))]
uart_shared!(LPUART, LPUART_RX, LPUART_TX,
    tx: [
        (PA2, AltFunction::AF6),
        (PB11, AltFunction::AF1),
        (PC1, AltFunction::AF1),
    ],
    rx: [
        (PA3, AltFunction::AF6),
        (PB10, AltFunction::AF1),
        (PC0, AltFunction::AF1),
    ],
    de: [
        (PB1, AltFunction::AF6),
        (PB12, AltFunction::AF1),
    ]
);

uart_full!(USART1, usart1, 1);

#[cfg(any(feature = "stm32g070", feature = "stm32g071", feature = "stm32g081"))]
uart_full!(USART2, usart2, 1);

#[cfg(any(
    feature = "stm32g030",
    feature = "stm32g031",
    feature = "stm32g041",
    feature = "stm32g0b1"
))]
uart_basic!(USART2, usart2, 1);

#[cfg(any(feature = "stm32g070", feature = "stm32g071", feature = "stm32g081"))]
uart_basic!(USART3, usart3, 1);

#[cfg(any(feature = "stm32g070", feature = "stm32g071", feature = "stm32g081"))]
uart_basic!(USART4, usart4, 1);

// LPUART Should be given its own implementation when it needs to be used with features not present on
// the basic feature set such as: Dual clock domain, FIFO or prescaler.
// Or when Synchronous mode is implemented for the basic feature set, since the LP feature set does not have support.
#[cfg(feature = "stm32g0x1")]
#[cfg(not(any(feature = "stm32g0b1", feature = "stm32g0c1")))]
uart_basic!(LPUART, lpuart, 256);
